module {
  func.func @main_graph(%arg0: !torch.vtensor<[128,512],f32>) -> !torch.vtensor<[128,128],f32> attributes {torch.onnx_meta.ir_version = 10 : si64, torch.onnx_meta.opset_version = 17 : si64, torch.onnx_meta.producer_name = "onnx.quantize", torch.onnx_meta.producer_version = "0.1.0"} {
    %0 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %1 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.0420744531> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %2 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %3 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.0239096731> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %4 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %5 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<3.47981724E-4> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %6 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.0.weight_quantized> : tensor<512x512xsi8>} : () -> !torch.vtensor<[512,512],si8>
    %7 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %8 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.0239096731> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %9 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %10 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<9.329000e-03> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %11 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %12 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<3.47982306E-4> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %13 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.2.weight_quantized> : tensor<512x512xsi8>} : () -> !torch.vtensor<[512,512],si8>
    %14 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %15 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<9.329000e-03> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %16 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %17 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.00384910358> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %18 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %19 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<3.47985246E-4> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %20 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.4.weight_quantized> : tensor<512x512xsi8>} : () -> !torch.vtensor<[512,512],si8>
    %21 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %22 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.00384910358> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %23 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %24 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.00165102445> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %25 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %26 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<3.47984926E-4> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %27 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.6.weight_quantized> : tensor<512x512xsi8>} : () -> !torch.vtensor<[512,512],si8>
    %28 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %29 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0.00165102445> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %30 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %31 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<9.78584168E-4> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %32 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %33 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<3.47981899E-4> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %34 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.8.weight_quantized> : tensor<512x512xsi8>} : () -> !torch.vtensor<[512,512],si8>
    %35 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %36 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<9.78584168E-4> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %37 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %38 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<6.4467889E-4> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %39 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si8>} : () -> !torch.vtensor<[],si8>
    %40 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<3.47974536E-4> : tensor<f32>} : () -> !torch.vtensor<[],f32>
    %41 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.10.weight_quantized> : tensor<128x512xsi8>} : () -> !torch.vtensor<[128,512],si8>
    %42 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.0.bias_quantized> : tensor<512xsi32>} : () -> !torch.vtensor<[512],si32>
    %43 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.0.bias_quantized_scale> : tensor<1xf32>} : () -> !torch.vtensor<[1],f32>
    %44 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si32>} : () -> !torch.vtensor<[],si32>
    %45 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.2.bias_quantized> : tensor<512xsi32>} : () -> !torch.vtensor<[512],si32>
    %46 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.2.bias_quantized_scale> : tensor<1xf32>} : () -> !torch.vtensor<[1],f32>
    %47 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si32>} : () -> !torch.vtensor<[],si32>
    %48 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.4.bias_quantized> : tensor<512xsi32>} : () -> !torch.vtensor<[512],si32>
    %49 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.4.bias_quantized_scale> : tensor<1xf32>} : () -> !torch.vtensor<[1],f32>
    %50 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si32>} : () -> !torch.vtensor<[],si32>
    %51 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.6.bias_quantized> : tensor<512xsi32>} : () -> !torch.vtensor<[512],si32>
    %52 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.6.bias_quantized_scale> : tensor<1xf32>} : () -> !torch.vtensor<[1],f32>
    %53 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si32>} : () -> !torch.vtensor<[],si32>
    %54 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.8.bias_quantized> : tensor<512xsi32>} : () -> !torch.vtensor<[512],si32>
    %55 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.8.bias_quantized_scale> : tensor<1xf32>} : () -> !torch.vtensor<[1],f32>
    %56 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si32>} : () -> !torch.vtensor<[],si32>
    %57 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.10.bias_quantized> : tensor<128xsi32>} : () -> !torch.vtensor<[128],si32>
    %58 = torch.operator "onnx.Constant"() {torch.onnx.value = dense_resource<_net.10.bias_quantized_scale> : tensor<1xf32>} : () -> !torch.vtensor<[1],f32>
    %59 = torch.operator "onnx.Constant"() {torch.onnx.value = dense<0> : tensor<si32>} : () -> !torch.vtensor<[],si32>
    %none = torch.constant.none
    %60 = torch.operator "onnx.QuantizeLinear"(%arg0, %1, %0) : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],si8>
    %61 = torch.operator "onnx.DequantizeLinear"(%42, %43, %44) : (!torch.vtensor<[512],si32>, !torch.vtensor<[1],f32>, !torch.vtensor<[],si32>) -> !torch.vtensor<[512],f32>
    %62 = torch.operator "onnx.DequantizeLinear"(%6, %5, %4) : (!torch.vtensor<[512,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[512,512],f32>
    %63 = torch.operator "onnx.DequantizeLinear"(%57, %58, %59) : (!torch.vtensor<[128],si32>, !torch.vtensor<[1],f32>, !torch.vtensor<[],si32>) -> !torch.vtensor<[128],f32>
    %64 = torch.operator "onnx.DequantizeLinear"(%41, %40, %39) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %65 = torch.operator "onnx.DequantizeLinear"(%45, %46, %47) : (!torch.vtensor<[512],si32>, !torch.vtensor<[1],f32>, !torch.vtensor<[],si32>) -> !torch.vtensor<[512],f32>
    %66 = torch.operator "onnx.DequantizeLinear"(%13, %12, %11) : (!torch.vtensor<[512,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[512,512],f32>
    %67 = torch.operator "onnx.DequantizeLinear"(%48, %49, %50) : (!torch.vtensor<[512],si32>, !torch.vtensor<[1],f32>, !torch.vtensor<[],si32>) -> !torch.vtensor<[512],f32>
    %68 = torch.operator "onnx.DequantizeLinear"(%20, %19, %18) : (!torch.vtensor<[512,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[512,512],f32>
    %69 = torch.operator "onnx.DequantizeLinear"(%51, %52, %53) : (!torch.vtensor<[512],si32>, !torch.vtensor<[1],f32>, !torch.vtensor<[],si32>) -> !torch.vtensor<[512],f32>
    %70 = torch.operator "onnx.DequantizeLinear"(%27, %26, %25) : (!torch.vtensor<[512,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[512,512],f32>
    %71 = torch.operator "onnx.DequantizeLinear"(%54, %55, %56) : (!torch.vtensor<[512],si32>, !torch.vtensor<[1],f32>, !torch.vtensor<[],si32>) -> !torch.vtensor<[512],f32>
    %72 = torch.operator "onnx.DequantizeLinear"(%34, %33, %32) : (!torch.vtensor<[512,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[512,512],f32>
    %73 = torch.operator "onnx.DequantizeLinear"(%60, %1, %0) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %74 = torch.operator "onnx.Gemm"(%73, %62, %61) {torch.onnx.alpha = 1.000000e+00 : f32, torch.onnx.beta = 1.000000e+00 : f32, torch.onnx.transA = 0 : si64, torch.onnx.transB = 1 : si64} : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[512,512],f32>, !torch.vtensor<[512],f32>) -> !torch.vtensor<[128,512],f32>
    %75 = torch.operator "onnx.QuantizeLinear"(%74, %3, %2) : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],si8>
    %76 = torch.operator "onnx.DequantizeLinear"(%75, %3, %2) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %77 = torch.operator "onnx.Relu"(%76) : (!torch.vtensor<[128,512],f32>) -> !torch.vtensor<[128,512],f32>
    %78 = torch.operator "onnx.QuantizeLinear"(%77, %8, %7) : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],si8>
    %79 = torch.operator "onnx.DequantizeLinear"(%78, %8, %7) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %80 = torch.operator "onnx.Gemm"(%79, %66, %65) {torch.onnx.alpha = 1.000000e+00 : f32, torch.onnx.beta = 1.000000e+00 : f32, torch.onnx.transA = 0 : si64, torch.onnx.transB = 1 : si64} : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[512,512],f32>, !torch.vtensor<[512],f32>) -> !torch.vtensor<[128,512],f32>
    %81 = torch.operator "onnx.QuantizeLinear"(%80, %10, %9) : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],si8>
    %82 = torch.operator "onnx.DequantizeLinear"(%81, %10, %9) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %83 = torch.operator "onnx.Relu"(%82) : (!torch.vtensor<[128,512],f32>) -> !torch.vtensor<[128,512],f32>
    %84 = torch.operator "onnx.QuantizeLinear"(%83, %15, %14) : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],si8>
    %85 = torch.operator "onnx.DequantizeLinear"(%84, %15, %14) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %86 = torch.operator "onnx.Gemm"(%85, %68, %67) {torch.onnx.alpha = 1.000000e+00 : f32, torch.onnx.beta = 1.000000e+00 : f32, torch.onnx.transA = 0 : si64, torch.onnx.transB = 1 : si64} : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[512,512],f32>, !torch.vtensor<[512],f32>) -> !torch.vtensor<[128,512],f32>
    %87 = torch.operator "onnx.QuantizeLinear"(%86, %17, %16) : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],si8>
    %88 = torch.operator "onnx.DequantizeLinear"(%87, %17, %16) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %89 = torch.operator "onnx.Relu"(%88) : (!torch.vtensor<[128,512],f32>) -> !torch.vtensor<[128,512],f32>
    %90 = torch.operator "onnx.QuantizeLinear"(%89, %22, %21) : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],si8>
    %91 = torch.operator "onnx.DequantizeLinear"(%90, %22, %21) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %92 = torch.operator "onnx.Gemm"(%91, %70, %69) {torch.onnx.alpha = 1.000000e+00 : f32, torch.onnx.beta = 1.000000e+00 : f32, torch.onnx.transA = 0 : si64, torch.onnx.transB = 1 : si64} : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[512,512],f32>, !torch.vtensor<[512],f32>) -> !torch.vtensor<[128,512],f32>
    %93 = torch.operator "onnx.QuantizeLinear"(%92, %24, %23) : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],si8>
    %94 = torch.operator "onnx.DequantizeLinear"(%93, %24, %23) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %95 = torch.operator "onnx.Relu"(%94) : (!torch.vtensor<[128,512],f32>) -> !torch.vtensor<[128,512],f32>
    %96 = torch.operator "onnx.QuantizeLinear"(%95, %29, %28) : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],si8>
    %97 = torch.operator "onnx.DequantizeLinear"(%96, %29, %28) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %98 = torch.operator "onnx.Gemm"(%97, %72, %71) {torch.onnx.alpha = 1.000000e+00 : f32, torch.onnx.beta = 1.000000e+00 : f32, torch.onnx.transA = 0 : si64, torch.onnx.transB = 1 : si64} : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[512,512],f32>, !torch.vtensor<[512],f32>) -> !torch.vtensor<[128,512],f32>
    %99 = torch.operator "onnx.QuantizeLinear"(%98, %31, %30) : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],si8>
    %100 = torch.operator "onnx.DequantizeLinear"(%99, %31, %30) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %101 = torch.operator "onnx.Relu"(%100) : (!torch.vtensor<[128,512],f32>) -> !torch.vtensor<[128,512],f32>
    %102 = torch.operator "onnx.QuantizeLinear"(%101, %36, %35) : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],si8>
    %103 = torch.operator "onnx.DequantizeLinear"(%102, %36, %35) : (!torch.vtensor<[128,512],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,512],f32>
    %104 = torch.operator "onnx.Gemm"(%103, %64, %63) {torch.onnx.alpha = 1.000000e+00 : f32, torch.onnx.beta = 1.000000e+00 : f32, torch.onnx.transA = 0 : si64, torch.onnx.transB = 1 : si64} : (!torch.vtensor<[128,512],f32>, !torch.vtensor<[128,512],f32>, !torch.vtensor<[128],f32>) -> !torch.vtensor<[128,128],f32>
    %105 = torch.operator "onnx.QuantizeLinear"(%104, %38, %37) : (!torch.vtensor<[128,128],f32>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,128],si8>
    %106 = torch.operator "onnx.DequantizeLinear"(%105, %38, %37) : (!torch.vtensor<[128,128],si8>, !torch.vtensor<[],f32>, !torch.vtensor<[],si8>) -> !torch.vtensor<[128,128],f32>
    return %106 : !torch.vtensor<[128,128],f32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      _net.0.weight_quantized: 