; ModuleID = 'matmul_dispatch_0'
source_filename = "matmul_dispatch_0"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-unknown-eabi-elf"

%iree_hal_executable_library_header_t = type { i32, ptr, i32, i32 }
%iree_hal_executable_dispatch_attrs_v0_t = type { i64, i16, i8, i8, i32, i32, i16, i16, i64, i64, i64, i64, i64 }
%iree_hal_executable_source_location_v0_t = type { i32, i32, ptr }
%iree_hal_executable_stage_location_table_v0_t = type { i32, ptr, ptr }
%iree_hal_executable_library_v0_t = type { ptr, %iree_hal_executable_import_table_v0_t, %iree_hal_executable_export_table_v0_t, %iree_hal_executable_constant_table_v0_t, %iree_hal_executable_source_file_table_v0_t }
%iree_hal_executable_import_table_v0_t = type { i32, ptr }
%iree_hal_executable_export_table_v0_t = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }
%iree_hal_executable_constant_table_v0_t = type { i32 }
%iree_hal_executable_source_file_table_v0_t = type { i32, ptr }
%struct.exp2f_data = type { [32 x i64], double, [3 x double], double, double, [3 x double] }
%struct.powf_log2_data = type { [16 x %struct.anon], [5 x double] }
%struct.anon = type { double, double }

@0 = internal constant [18 x i8] c"matmul_dispatch_0\00", align 1
@iree_hal_executable_library_query_v0_header = internal constant %iree_hal_executable_library_header_t { i32 6, ptr @0, i32 0, i32 0 }
@1 = internal constant [5 x i8] c"free\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C17, file: !1, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!1 = !DIFile(filename: "configured_module_matmul_dispatch_0.mlir", directory: "/Users/sparshsingh/work/merlin/compiler/plugins/target/Gemmini/test/Output/gemmini_matmul_lowering.mlir.tmp.dir")
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{!5, !5, i64 0}
!5 = !{!"int", !6, i64 0}
!6 = !{!"omnipotent char", !7, i64 0}
!7 = !{!"Simple C/C++ TBAA"}
!8 = distinct !DISubprogram(name: "matmul_dispatch_0_matmul_4x4x4_f32", linkageName: "matmul_dispatch_0_matmul_4x4x4_f32", scope: !1, file: !1, line: 1, type: !9, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0)
!9 = !DISubroutineType(cc: DW_CC_normal, types: !10)
!10 = !{!11, !12, !43, !72}
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_environment_v0_t", baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_environment_v0_t", scope: !16, file: !16, line: 246, size: 768, elements: !17)
!16 = !DIFile(filename: "runtime/src/iree/hal/local/executable_library.h", directory: ".")
!17 = !{!18, !26, !29, !32, !34}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_array_type, scope: !16, file: !16, line: 227, baseType: !22, size: 2048, elements: !24)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", baseType: !23)
!23 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!24 = !{!25}
!25 = !DISubrange(count: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "import_thunk", baseType: !27, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIBasicType(name: "void", encoding: DW_ATE_address)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "import_funcs", baseType: !30, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "import_contexts", baseType: !33, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "processor", baseType: !35, offset: 256)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_processor_v0_t", scope: !16, file: !16, line: 227, size: 512, elements: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !38)
!38 = !DICompositeType(tag: DW_TAG_array_type, scope: !16, file: !16, line: 227, baseType: !39, size: 512, elements: !41)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", baseType: !40)
!40 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !{!42}
!42 = !DISubrange(count: 8)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_dispatch_state_v0_t", baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_dispatch_state_v0_t", scope: !16, file: !16, line: 275, size: 384, elements: !47)
!47 = !{!48, !49, !50, !53, !54, !55, !56, !57, !60, !61, !62, !67}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_x", baseType: !22, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_y", baseType: !22, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_z", baseType: !51, size: 16, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", baseType: !52)
!52 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "constant_count", baseType: !51, size: 16, offset: 80)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_x", baseType: !22, size: 32, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_y", baseType: !22, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_z", baseType: !51, size: 16, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "max_concurrency", baseType: !58, size: 8, offset: 176)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "binding_count", baseType: !58, size: 8, offset: 184)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !19, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "binding_ptrs", baseType: !63, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, scope: !16, file: !16, line: 227, baseType: !66, size: 4096, elements: !24)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "binding_lengths", baseType: !68, size: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_array_type, scope: !16, file: !16, line: 227, baseType: !71, size: 4096, elements: !24)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", baseType: !39)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_workgroup_state_v0_t", baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_workgroup_state_v0_t", scope: !16, file: !16, line: 321, size: 256, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !83}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_x", baseType: !22, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_y", baseType: !22, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_z", baseType: !51, size: 16, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", baseType: !51, size: 16, offset: 80)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", baseType: !22, size: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory", baseType: !27, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory_size", baseType: !22, size: 32, offset: 192)
!84 = !DILocation(line: 10, column: 8, scope: !8)
!85 = !DILocation(line: 11, column: 8, scope: !8)
!86 = !DILocation(line: 12, column: 8, scope: !8)
!87 = !DILocation(line: 16, column: 8, scope: !8)
!88 = !{!"branch_weights", i32 1, i32 0}
!89 = !DILocation(line: 0, scope: !8)
!90 = !{!91, !91, i64 0}
!91 = !{!"short", !6, i64 0}
!92 = !{!93, !93, i64 0}
!93 = !{!"float", !6, i64 0}
!94 = !{!"branch_weights", !"expected", i32 2000, i32 1}
!95 = !{!96, !96, i64 0}
!96 = !{!"long", !6, i64 0}
!97 = !{!"branch_weights", i32 4001, i32 4000000}
!98 = !{!99, !100, i64 0}
!99 = !{!"", !100, i64 0, !100, i64 8}
!100 = !{!"double", !6, i64 0}
!101 = !{!99, !100, i64 8}
!102 = !{!"branch_weights", !"expected", i32 1, i32 2000}
